/**
 ***********************************************************************************************************************
 * @file           : app-ui.h
 * @brief          : UI界面业务逻辑处理应用
 * @author         : 李嘉豪
 * @date           : 2025-07-05
 ***********************************************************************************************************************
 * @attention
 *
 * UI界面的业务逻辑处理文件
 *
 ***********************************************************************************************************************
 **/




/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __APP_UI_H__
#define __APP_UI_H__




/*-------- includes --------------------------------------------------------------------------------------------------*/

#include <stdint.h>




/*-------- typedef ---------------------------------------------------------------------------------------------------*/

typedef enum {
    UI_STATE_ADJUST_BROUWSE, // 调节浏览状态
    UI_STATE_ADJUST_EDIT,    // 调节编辑状态
    UI_STATE_FIGURE_VIEW,    // 图形查看状态
} uiStateTypeDef;            // UI状态枚举类型定义

// UI状态机类型定义
typedef struct {
    uiStateTypeDef curState;         // 当前UI状态
    uiStateTypeDef nextState;        // 下一个UI状态
    uint8_t (*conditionFunc)(void*); // 状态转换条件函数指针
    void (*actionFunc)(void*);       // 状态动作函数指针
} uiStateTransitionTypeDef;


typedef struct {
    void* graphicsBuffers;
} uiAppParamTypeDef;




/*-------- define ----------------------------------------------------------------------------------------------------*/





/*-------- macro -----------------------------------------------------------------------------------------------------*/





/*-------- variables -------------------------------------------------------------------------------------------------*/

extern uiAppParamTypeDef uiAppParam; // UI应用参数对象




/*-------- function prototypes ---------------------------------------------------------------------------------------*/

void uiAppInit(void* argument); // UI应用初始化函数
void uiAppLoop(void* argument); // UI应用循环函数




#endif /* __APP_UI_H__ */
