/**
 ***********************************************************************************************************************
 * @file           : app-signal.h
 * @brief          : 信号处理和生成
 * @author         : 李嘉豪
 * @date           : 2025-07-07
 ***********************************************************************************************************************
 * @attention
 *
 * 信号处理和生成应用
 *
 ***********************************************************************************************************************
 **/




/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __APP_SIGNAL_H__
#define __APP_SIGNAL_H__




/*-------- includes --------------------------------------------------------------------------------------------------*/

#include <stdint.h>


/*-------- define ----------------------------------------------------------------------------------------------------*/

#define WAVE_LEN 600





/*-------- typedef ---------------------------------------------------------------------------------------------------*/

#ifndef SINGAL_TYPE_DEF
#define SINGAL_TYPE_DEF
typedef struct {
    float freq;      // 频率
    float amp;       // 幅度
    uint16_t phase;  // 相位
} SignalInfoTypeDef; // 信号信息类型定义
#endif               /* SINGAL_TYPE_DEF */

typedef struct {
    SignalInfoTypeDef signalInfo[2]; // 信号信息数组
    uint16_t sign[2][WAVE_LEN];      // 信号数据数组
    __packed union {
        uint32_t adcBuf; // ADC采样值
        __packed struct {
            uint16_t signal1; // 信号1采样值
            uint16_t signal2; // 信号2采样值
        } adcValues;
    } adcData; // ADC数据联合体

} SignalAppParamTypeDef; // 信号应用参数类型定义





/*-------- macro -----------------------------------------------------------------------------------------------------*/





/*-------- variables -------------------------------------------------------------------------------------------------*/





/*-------- function prototypes ---------------------------------------------------------------------------------------*/

void signalAppInit(void* argument); // 信号应用初始化函数
void signalAppLoop(void* argument); // 信号应用循环函数





#endif /* __APP_SIGNAL_H__ */
