/**
 ***********************************************************************************************************************
 * @file           : controller-service.h
 * @brief          : 控制器计算服务
 * @author         : 李嘉豪
 * @date           : 2025-07-13
 ***********************************************************************************************************************
 * @attention
 *
 * 用于建造和使用控制器
 *
 ***********************************************************************************************************************
 **/




/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __CONTROLLER_SERVICE_H__
#define __CONTROLLER_SERVICE_H__




/*-------- includes --------------------------------------------------------------------------------------------------*/





/*-------- typedef ---------------------------------------------------------------------------------------------------*/

typedef struct {
    float kp;
    float ki;
    float kd;
    float integral;     // 积分值
    float prevErr;      // 上一次误差值
    float output;       // 输出值
} PIDControllerTypeDef; // PID控制器类型定义

typedef struct {
    void (*pidInit)(PIDControllerTypeDef* pid, float kp, float ki, float kd);                   // PID控制器初始化函数
    void (*pidCalculate)(PIDControllerTypeDef* pid, float reference, float feedback, float dt); // PID计算函数
    void (*pidReset)(PIDControllerTypeDef* pid);                                                // PID控制器重置函数
} CtrlServIntfTypeDef;




/*-------- define ----------------------------------------------------------------------------------------------------*/





/*-------- macro -----------------------------------------------------------------------------------------------------*/





/*-------- variables -------------------------------------------------------------------------------------------------*/

extern CtrlServIntfTypeDef ctrlServIntf;




/*-------- function prototypes ---------------------------------------------------------------------------------------*/





#endif /* __CONTROLLER_SERVICE_H__ */
